In [5]:
import MySQLdb

In [6]:
db1 = MySQLdb.connect("mysql", "root", "example", "university")
cursor1 = db1.cursor()
cursor1.execute("select * from instructor")
professores = cursor1.fetchall()
professores

(('10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00')),
 ('12121', 'Wu', 'Finance', Decimal('90000.00')),
 ('15151', 'Mozart', 'Music', Decimal('40000.00')),
 ('22222', 'Einstein', 'Physics', Decimal('95000.00')),
 ('32343', 'El Said', 'History', Decimal('60000.00')),
 ('33456', 'Gold', 'Physics', Decimal('87000.00')),
 ('45565', 'Katz', 'Comp. Sci.', Decimal('75000.00')),
 ('58583', 'Califieri', 'History', Decimal('62000.00')),
 ('76543', 'Singh', 'Finance', Decimal('80000.00')),
 ('76766', 'Crick', 'Biology', Decimal('72000.00')),
 ('83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00')),
 ('98345', 'Kim', 'Elec. Eng.', Decimal('80000.00')))

In [7]:
import pandas as pd
df = pd.read_sql_query("select * from student", db1)
df.head()

      ID     name   dept_name  tot_cred
0  00128    Zhang  Comp. Sci.     102.0
1  12345  Shankar  Comp. Sci.      32.0
2  19991   Brandt     History      80.0
3  23121   Chavez     Finance     110.0
4  44553  Peltier     Physics      56.0

In [8]:
import psycopg2
db2 = psycopg2.connect(host="postgres", database="university", user="postgres", password="example")
cursor2 = db2.cursor()
cursor2.execute("select * from student")
dados2 = cursor2.fetchall()
dados2

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('19991', 'Brandt', 'History', Decimal('80')),
 ('23121', 'Chavez', 'Finance', Decimal('110')),
 ('44553', 'Peltier', 'Physics', Decimal('56')),
 ('45678', 'Levy', 'Physics', Decimal('46')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('55739', 'Sanchez', 'Music', Decimal('38')),
 ('70557', 'Snow', 'Physics', Decimal('0')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58')),
 ('76653', 'Aoi', 'Elec. Eng.', Decimal('60')),
 ('98765', 'Bourikas', 'Elec. Eng.', Decimal('98')),
 ('98988', 'Tanaka', 'Biology', Decimal('120'))]

In [10]:
print(db1.query("select * from student;"))

None